[
  {
    "title": "Modern Loft with Balcony – Navigli",
    "description": "Bright modern loft in Navigli with high ceilings, large balcony overlooking the canal, brand new kitchen, dishwasher, built-in wardrobe, smart TV, fast Wi-Fi. Full sunlight all day. Fully furnished, pets allowed (cats and small dogs). 4th floor with elevator, 5 minutes walk to metro, surrounded by bars and restaurants.",
    "district": "Navigli",
    "price": "1400",
    "furnished": true,
    "pets_allowed": true,
    "url": "https://www.idealista.it/immobile/32872802/"
  },
  {
    "title": "Duomo Designer Studio",
    "description": "Designer studio 2 minutes from Piazza Duomo. Elevator, air conditioning, washing machine. Cozy and quiet despite central location. Historic building, beautiful view of the cathedral. Strictly no pets. Fully furnished. Ideal for one person or expat couple. Near metro lines M1/M3, tram, and supermarkets.",
    "district": "Centro",
    "price": "1200",
    "furnished": true,
    "pets_allowed": false,
    "url": "https://www.idealista.it/immobile/33029429/"
  },
  {
    "title": "Large Family Flat – Brera",
    "description": "Spacious three-bedroom apartment in elegant Brera area, huge living room, separate kitchen with all appliances, two balconies, large bathroom with bathtub and shower. Unfurnished (kitchen included). Small pets allowed. 3rd floor, elevator. Walking distance to Parco Sempione, fashion streets, and Moscova metro.",
    "district": "Brera",
    "price": "2200",
    "furnished": false,
    "pets_allowed": true,
    "url": "https://www.idealista.it/immobile/10486516/"
  },
  {
    "title": "Sunny Top-floor in Porta Romana",
    "description": "Sunny and quiet one-bedroom on the top floor in Porta Romana, large French windows, balcony with city view. New appliances (oven, fridge, washer). Partially furnished (wardrobe, table, sofa). No pets. 7 min to Porta Romana metro. Quiet courtyard. Bike parking available.",
    "district": "Porta Romana",
    "price": "1100",
    "furnished": true,
    "pets_allowed": false,
    "url": "https://www.idealista.it/immobile/33104067/"
  },
  {
    "title": "Isola Attic w/ Terrace",
    "description": "Unique attic apartment in Isola with private 18 m² terrace. Recently renovated, open-space kitchen, built-in wardrobes, separate sleeping area. Unfurnished. Pets welcome. 5th floor with elevator, bright and quiet. Close to Garibaldi FS and metro, perfect for young professionals.",
    "district": "Isola",
    "price": "1350",
    "furnished": false,
    "pets_allowed": true,
    "url": "https://www.idealista.it/immobile/32307276/"
  },
  {
    "title": "City Life Smart Home",
    "description": "High-end designer apartment in City Life district, panoramic windows, modern furniture, smart home system, high-speed fiber internet. Gym and pool in building. No pets. Fully furnished. Walking distance to Tre Torri metro, shopping center, and green parks.",
    "district": "City Life",
    "price": "1800",
    "furnished": true,
    "pets_allowed": false,
    "url": "https://www.immobiliare.it/annunci/120519180/"
  },
  {
    "title": "Budget Studio – Lambrate FS",
    "description": "Affordable studio, ground floor in quiet side street near Lambrate FS station and Polytechnic. Not furnished, no pets. Large window, kitchenette, bathroom with shower. Ideal for students or young professionals. 8 min to green line metro. Low expenses.",
    "district": "Lambrate",
    "price": "800",
    "furnished": false,
    "pets_allowed": false,
    "url": "https://www.immobiliare.it/annunci/121443206/"
  },
  {
    "title": "Bicocca Family Home",
    "description": "Three-room flat in Bicocca with spacious living room, two bedrooms, separate kitchen, two balconies. Green courtyard, playground for kids. Pets allowed (all sizes). Fully furnished, washing machine, dishwasher. 3rd floor with elevator. Close to Bicocca University, tram 7, and supermarkets.",
    "district": "Bicocca",
    "price": "1250",
    "furnished": true,
    "pets_allowed": true,
    "url": "https://www.immobiliare.it/annunci/121499282/?entryPoint=related"
  },
  {
    "title": "Porta Venezia Renovated One-bedroom",
    "description": "Brand new renovation! One-bedroom apartment with high ceilings, big windows, French balcony, and separate kitchen. No pets. Unfurnished except for kitchen and built-in wardrobes. 2nd floor, elevator. 5 min to Porta Venezia metro, supermarket, and Corso Buenos Aires shopping street.",
    "district": "Porta Venezia",
    "price": "1000",
    "furnished": false,
    "pets_allowed": false,
    "url": "https://www.immobiliare.it/annunci/121352990/"
  },
  {
    "title": "Mini-apartment in Sempione",
    "description": "Furnished mini-apartment in Sempione zone, 5th floor with elevator, balcony overlooking quiet garden. Fully equipped kitchen, fast Wi-Fi. Pets allowed (cat/dog), ideal for single or couple. Quiet, safe building with bike room. Near park, tram, and Carrefour Express.",
    "district": "Sempione",
    "price": "1150",
    "furnished": true,
    "pets_allowed": true,
    "url": "https://www.immobiliare.it/annunci/121002222/"
  }
]
